# Using Python Language to develop a calculator which will import candidate's record csv file and then calculates the median of their score based on their previous track record number

### Importing libraries

In [26]:
import pandas as pd
import numpy as np
from scipy import stats

### Importing candidate.csv file

In [14]:
data = pd.read_csv('C:\Users\Acer\Desktop\candidate.csv')

### Checking Data

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 15 columns):
first_name      500 non-null object
last_name       500 non-null object
company_name    500 non-null object
address         500 non-null object
city            500 non-null object
county          500 non-null object
state           500 non-null object
zip             500 non-null int64
phone1          500 non-null object
phone2          500 non-null object
email           500 non-null object
qtr1            500 non-null int64
qtr2            500 non-null int64
qtr3            500 non-null int64
qtr4            500 non-null int64
dtypes: int64(5), object(10)
memory usage: 58.7+ KB

### Visualising Data

In [16]:
data.head(3)

,first_name,last_name,company_name,address,city,county,state,zip,phone1,phone2,email,qtr1,qtr2,qtr3,qtr4
0,James,Butt,"Benton, John B Jr",6649 N Blue Gum St,New Orleans,Orleans,LA,70116,504-621-8927,504-845-1427,jbutt@gmail.com,83,78,88,96
1,Josephine,Darakjy,"Chanay, Jeffrey A Esq",4 B Blue Ridge Blvd,Brighton,Livingston,MI,48116,810-292-9388,810-374-9840,josephine_darakjy@darakjy.org,96,85,75,77
2,Art,Venere,"Chemel, James L Cpa",8 W Cerritos Ave #54,Bridgeport,Gloucester,NJ,8014,856-636-8749,856-264-4130,art@venere.org,84,96,84,74

In [17]:
data.drop(["company_name","zip"], axis = 1, inplace = True)

### Here we have dropped two unnecessary columns and the columns "qtr1" , "qtr2" , "qtr3" and "qtr4" are depicting the previous track records numbers of the candidates

In [18]:
data.head(3)

,first_name,last_name,address,city,county,state,phone1,phone2,email,qtr1,qtr2,qtr3,qtr4
0,James,Butt,6649 N Blue Gum St,New Orleans,Orleans,LA,504-621-8927,504-845-1427,jbutt@gmail.com,83,78,88,96
1,Josephine,Darakjy,4 B Blue Ridge Blvd,Brighton,Livingston,MI,810-292-9388,810-374-9840,josephine_darakjy@darakjy.org,96,85,75,77
2,Art,Venere,8 W Cerritos Ave #54,Bridgeport,Gloucester,NJ,856-636-8749,856-264-4130,art@venere.org,84,96,84,74

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 13 columns):
first_name    500 non-null object
last_name     500 non-null object
address       500 non-null object
city          500 non-null object
county        500 non-null object
state         500 non-null object
phone1        500 non-null object
phone2        500 non-null object
email         500 non-null object
qtr1          500 non-null int64
qtr2          500 non-null int64
qtr3          500 non-null int64
qtr4          500 non-null int64
dtypes: int64(4), object(9)
memory usage: 50.9+ KB

In [20]:
df = pd.DataFrame(data)

### Calculating median of the track record number columns "qtr1" , "qtr2" , "qtr3" and "qtr4" and saving the result into another column named as "Median"

In [21]:
df.insert(13, "Median", data.median(axis=1), True)

## Below is the sample result

In [22]:
df.head(3)

,first_name,last_name,address,city,county,state,phone1,phone2,email,qtr1,qtr2,qtr3,qtr4,Median
0,James,Butt,6649 N Blue Gum St,New Orleans,Orleans,LA,504-621-8927,504-845-1427,jbutt@gmail.com,83,78,88,96,85.5
1,Josephine,Darakjy,4 B Blue Ridge Blvd,Brighton,Livingston,MI,810-292-9388,810-374-9840,josephine_darakjy@darakjy.org,96,85,75,77,81.0
2,Art,Venere,8 W Cerritos Ave #54,Bridgeport,Gloucester,NJ,856-636-8749,856-264-4130,art@venere.org,84,96,84,74,84.0

### Exporting the complete result of 500 candidates in a csv file format named as "can_trck.csv"

In [25]:
df.to_csv("can_trck.csv", sep=',')